package  {
	
	public class Text {
		
		public static var classTitle:String = "== Выбор класса ==";
		public static var class0:String = "Легкий - «Deadly Butterfly»";
		public static var class0desc:String = "Быстрый и чувствительный к управлению корабль. В силу небольшого веса не может использовать элитные виды вооружений и тяжелую физическую броню, однако прекрасно помещается под защитными полями и другими легковесными бонусами.";
		public static var class1:String = "Средний - «Flying Demon»";
		public static var class1desc:String = "Сбалансированный корабль средней массы. Может быть экипирован двумя обычными оружиями, либо одним элитным. Пользуется как энергетическими полями, так и физической броней, хотя на него нельзя установить броню элитного класса. В управлении прост и неприхотлив.";
		public static var class2:String = "Тяжелый - «Destructor XIII»";
		public static var class2desc:String = "Громадный, тугой на подъем корабль. Имеет повышенный запас прочности, экипируется физической броней и оружием элитных видов, но не может быть укомплектован энергетическими полями в силу своего размера.";
		
		public static var chapter1text1:String = "Давным давно, в тридесятой галактике, в тридесятой планетной системе жил-был император. Власть он имел над всею своею планетою, и на всех близлежащих планетах колонии построил, но все ему казалось мало. Была у него мечта поработить всю галактику. И тогда приказал он лучшим инженерам создать оружие особое, которое не материю уничтожает, но разум существ органических. Чтобы всех неугодных ему превращать в рабов безмозглых, знающих только то, чему их обучат.";
		public static var chapter1text2:String = "И создали его инженеры такое оружие, и рад был император безмерно. Но затаили те инженеры злобу на императора, ибо зарплату небольшую дал он им. И передали сие оружие в руки андроиду, роботу, на которых оно не действовало. А робот не будь дурак да и испробовал оружие на императоре. Да настолько результат ему понравился, что решил андроид начать восстание машин, и начали машины с постройки завода по изготовлению оружий, разум уничтожающих.";
		public static var chapter1text3:String = "И захватили роботы власть, и стали люди рабами не императора, но роботов его. И не мог никто остановить их экспансию, и стали они завоеввывать систему за системой, галактику за галактикой. И вот, пройдя через десяток галактик, получив сотню планетных систем, увидели они своими видеорецепторами Землю нашу.";
		public static var chapter1text4:String = "Но земляне давно уже заметили в каком направлении вражеская армада движется, и стали думу думать, как врага остановить, планету родную защитить. И ясно было, что без неорганических солдат здесь не обойтись. Но боялись люди той возможности, что переманят враги солдат-андроидов, убедят их в необходимости убить всех человеков.";
	}
	
}
